---
kind: other
id: Methods.T:Autodesk.Revit.DB.SolidCurveIntersection
source: html/47cbd346-bb95-ed0a-801e-c67b1b103ab8.htm
---
# SolidCurveIntersection Methods

Returns an enumerator that iterates through a collection.